[
    {
        "endpoint": "/chat/chatroom",
        "section": "chat",
        "method": "POST",
        "description": "Used to Create a New Chatroom Between a Doctor and a Patient. The system prevents duplicate chatrooms by checking if a chatroom already exists between the same doctor and patient before creating a new one. Chatrooms are automatically created when appointments are made, but this endpoint allows manual creation if needed.",
        "parameters": [
            {
                "paramName": "doctorID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Doctor who will be part of the chatroom"
            },
            {
                "paramName": "patientID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Patient who will be part of the chatroom"
            }
        ],
        "requestExample": {
            "doctorID": "doctor123abc",
            "patientID": "patient456xyz"
        },
        "responseDescription": "Receives 'Done' Text if Everything Went Well, or one of the common Errors (Missing Parameters, The Chatroom Already Exists, Patient Not Found, Doctor Not Found)"
    },
    {
        "endpoint": "/chat/chatroom/partner",
        "section": "chat",
        "method": "POST",
        "description": "Used to Create a New Chatroom Between a Partner and a Patient. Partners are family members or caregivers who can communicate with patients. The system prevents duplicate chatrooms by checking if a chatroom already exists between the same partner and patient.",
        "parameters": [
            {
                "paramName": "partnerID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Partner who will be part of the chatroom"
            },
            {
                "paramName": "patientID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Patient who will be part of the chatroom"
            }
        ],
        "requestExample": {
            "partnerID": "partner789def",
            "patientID": "patient456xyz"
        },
        "responseDescription": "Receives 'Done' Text if Everything Went Well, or one of the common Errors (Missing Parameters, The Chatroom Already Exists, Patient Not Found, Partner Not Found)"
    },
    {
        "endpoint": "/chat/chatrooms",
        "section": "chat",
        "method": "GET",
        "description": "Used to Get All Chatrooms for a Specific User (Patient, Doctor, or Partner). Returns an array of chatrooms with full participant information, ordered by the most recently updated chatroom first. Each chatroom includes patient, doctor, and partner details along with metadata like last message, quota, and unseen count.",
        "parameters": [
            {
                "paramName": "userID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the User (Patient, Doctor, or Partner) whose chatrooms are being retrieved"
            },
            {
                "paramName": "role",
                "paramType": "String",
                "paramDescription": "The role of the user. Must be one of: 'patient', 'doctor', or 'partner'"
            }
        ],
        "requestExample": {
            "userID": "patient456xyz",
            "role": "patient"
        },
        "responseExample": [
            {
                "id": "1",
                "patient": {
                    "id": "patient456xyz",
                    "name": "John Doe",
                    "profileImage": "https://example.com/profilePic/patient1.jpg"
                },
                "doctor": {
                    "id": "doctor123abc",
                    "name": "Dr. Jane Smith",
                    "title": "Psychiatrist",
                    "profileImage": "https://example.com/profilePic/doctor1.jpg"
                },
                "partner": null,
                "appointment": null,
                "chatType": "doctor-patient",
                "quota": 10,
                "unseenCount": 3,
                "lastMessage": "Hello, how are you feeling today?",
                "lastSender": "doctor",
                "lastUpdate": "2024-01-15T10:30:00.000Z",
                "createdAt": "2024-01-10T08:00:00.000Z",
                "updatedAt": "2024-01-15T10:30:00.000Z"
            }
        ],
        "responseDescription": "Receives an Array of Chatrooms with Full Participant Information (id, patient details, doctor/partner details, appointment reference, chatType, quota, unseenCount, lastMessage, lastSender, lastUpdate, createdAt, updatedAt), or an Empty Array if No Chatrooms Exist, or one of the common Errors (Missing Parameters, Invalid Role)"
    },
    {
        "endpoint": "/chat/messages",
        "section": "chat",
        "method": "GET",
        "description": "Used to Get All Messages for a Specific Chatroom. Returns an array of messages ordered chronologically from oldest to newest. Each message includes the text content, sender role, seen status, deleted status, and timestamps. Messages are automatically marked as seen when retrieved: if a patient/partner requests messages, all doctor messages are marked as seen; if a doctor requests messages, all patient/partner messages are marked as seen. Deleted messages are excluded from the response.",
        "parameters": [
            {
                "paramName": "chatroomID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Chatroom whose messages are being retrieved"
            },
            {
                "paramName": "role",
                "paramType": "String",
                "paramDescription": "The role of the user requesting messages. Must be one of: 'patient', 'doctor', or 'partner'. Used to automatically mark opposite-side messages as seen."
            }
        ],
        "requestExample": {
            "chatroomID": "1",
            "role": "patient"
        },
        "responseExample": [
            {
                "id": "1",
                "text": "Hello, I have a question about my medication.",
                "senderRole": "patient",
                "seen": true,
                "deleted": false,
                "attachment": null,
                "createdAt": "2024-01-15T09:00:00.000Z",
                "updatedAt": "2024-01-15T09:00:00.000Z"
            },
            {
                "id": "2",
                "text": "I'd be happy to help. What would you like to know?",
                "senderRole": "doctor",
                "seen": true,
                "deleted": false,
                "attachment": null,
                "createdAt": "2024-01-15T09:05:00.000Z",
                "updatedAt": "2024-01-15T09:05:00.000Z"
            },
            {
                "id": "3",
                "text": "Here's the document you requested.",
                "senderRole": "patient",
                "seen": false,
                "deleted": false,
                "attachment": "https://example.com/file/1234567890.pdf",
                "createdAt": "2024-01-15T09:10:00.000Z",
                "updatedAt": "2024-01-15T09:10:00.000Z"
            }
        ],
        "responseDescription": "Receives an Array of Messages with Full Information (id, text, senderRole, seen status, deleted status, attachment URL, createdAt, updatedAt). Chatroom information is not included. Messages are automatically marked as seen based on the requester's role. Deleted messages are excluded. Attachment is null if no attachment was included with the message. Returns an Empty Array if No Messages Exist, or one of the common Errors (Missing Parameters, Chatroom Not Found)"
    },
    {
        "endpoint": "/chat/message",
        "section": "chat",
        "method": "POST",
        "description": "Used to Send a New Message in a Chatroom. When a patient sends a message, their quota is decremented by 1. The system checks if the patient has available quota before allowing the message to be sent. A silent FCM notification is automatically sent to the recipient using the topic pattern 'customer_{userId}'. The chatroom's last message, last sender, and last update timestamp are automatically updated. Messages can include an optional attachment by providing the URL returned from the file upload endpoint.",
        "parameters": [
            {
                "paramName": "chatroomID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Chatroom where the message will be sent"
            },
            {
                "paramName": "senderRole",
                "paramType": "String",
                "paramDescription": "The role of the message sender. Must be one of: 'patient', 'doctor', or 'partner'"
            },
            {
                "paramName": "text",
                "paramType": "String (Text)",
                "paramDescription": "The text content of the message"
            },
            {
                "paramName": "attachment",
                "paramType": "String (URL)",
                "paramDescription": "Optional. The URL link to the attachment file returned from the upload endpoint (e.g., from POST /upload). If provided, the message will include this attachment."
            }
        ],
        "requestExample": {
            "chatroomID": "1",
            "senderRole": "patient",
            "text": "Here's the document you requested.",
            "attachment": "https://example.com/file/1234567890.pdf"
        },
        "responseDescription": "Receives 'Done' Text if Everything Went Well, or one of the common Errors (Missing Parameters, Chatroom Not Found, You Have Exceeded Your Available Quota - only for patients)"
    },
    {
        "endpoint": "/chat/message",
        "section": "chat",
        "method": "PUT",
        "description": "Used to Edit an Existing Message. Only the sender of the message can edit it. The message must not be deleted. You can update the text content and optionally the attachment. If attachment is not provided in the request, it will remain unchanged.",
        "parameters": [
            {
                "paramName": "messageID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Message to be edited"
            },
            {
                "paramName": "senderRole",
                "paramType": "String",
                "paramDescription": "The role of the user editing the message. Must match the original sender's role. Must be one of: 'patient', 'doctor', or 'partner'"
            },
            {
                "paramName": "text",
                "paramType": "String (Text)",
                "paramDescription": "The updated text content of the message"
            },
            {
                "paramName": "attachment",
                "paramType": "String (URL)",
                "paramDescription": "Optional. The updated URL link to the attachment file. If not provided, the existing attachment will remain unchanged. Set to null to remove attachment."
            }
        ],
        "requestExample": {
            "messageID": "5",
            "senderRole": "patient",
            "text": "Updated message text here.",
            "attachment": "https://example.com/file/updated123.pdf"
        },
        "responseDescription": "Receives 'Done' Text if Everything Went Well, or one of the common Errors (Missing Parameters, Message Not Found, Cannot edit a deleted message, You can only edit your own messages)"
    },
    {
        "endpoint": "/chat/message",
        "section": "chat",
        "method": "DELETE",
        "description": "Used to Delete a Message (Soft Delete). Only the sender of the message can delete it. The message is marked as deleted (soft delete) and will no longer appear in message lists, but the data is preserved in the database. Deleted messages are automatically excluded from GET /chat/messages responses.",
        "parameters": [
            {
                "paramName": "messageID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Message to be deleted"
            },
            {
                "paramName": "senderRole",
                "paramType": "String",
                "paramDescription": "The role of the user deleting the message. Must match the original sender's role. Must be one of: 'patient', 'doctor', or 'partner'"
            }
        ],
        "requestExample": {
            "messageID": "5",
            "senderRole": "patient"
        },
        "responseDescription": "Receives 'Done' Text if Everything Went Well, or one of the common Errors (Missing Parameters, Message Not Found, Message is already deleted, You can only delete your own messages)"
    },
    {
        "endpoint": "/chat/mark-seen",
        "section": "chat",
        "method": "POST",
        "description": "Used to Mark All Unseen Messages as Seen in a Chatroom. This endpoint marks all messages from the opposite side (not sent by the current user) as seen and resets the chatroom's unseen count to 0. For example, if a patient calls this endpoint, all messages sent by the doctor or partner will be marked as seen.",
        "parameters": [
            {
                "paramName": "chatroomID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Chatroom where messages should be marked as seen"
            },
            {
                "paramName": "role",
                "paramType": "String",
                "paramDescription": "The role of the user marking messages as seen. Must be one of: 'patient', 'doctor', or 'partner'"
            }
        ],
        "requestExample": {
            "chatroomID": "1",
            "role": "patient"
        },
        "responseDescription": "Receives 'Done' Text if Everything Went Well, or one of the common Errors (Missing Parameters, Chatroom Not Found)"
    },
    {
        "endpoint": "/chat/plans",
        "section": "chat",
        "method": "GET",
        "description": "Used to Get All Available Chat Plans. Chat plans define the message quota packages that patients can purchase. Each plan includes the price, currency, and the number of messages included in that plan.",
        "parameters": [],
        "requestExample": {},
        "responseExample": [
            {
                "id": "1",
                "price": 9.99,
                "currency": "USD",
                "amount": 50
            },
            {
                "id": "2",
                "price": 19.99,
                "currency": "USD",
                "amount": 120
            },
            {
                "id": "3",
                "price": 29.99,
                "currency": "USD",
                "amount": 200
            }
        ],
        "responseDescription": "Receives an Array of Chat Plans with Information (id, price, currency, amount - number of messages), or an Empty Array if No Plans Exist"
    },
    {
        "endpoint": "/chat/plan-update",
        "section": "chat",
        "method": "POST",
        "description": "Used to Update a Chatroom's Message Quota When a Patient Purchases a Chat Plan. This endpoint is typically called after a successful payment transaction. It updates the chatroom's quota to the amount specified in the purchased plan, allowing the patient to send more messages.",
        "parameters": [
            {
                "paramName": "chatroomID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Chatroom whose quota will be updated"
            },
            {
                "paramName": "quotaID",
                "paramType": "String (255)",
                "paramDescription": "The ID of the Chat Plan that was purchased (defines the quota amount)"
            }
        ],
        "requestExample": {
            "chatroomID": "1",
            "quotaID": "2"
        },
        "responseDescription": "Receives 'Done' Text if Everything Went Well, or one of the common Errors (Missing Parameters, Chatroom Not Found, Chat Plan Not Found)"
    }
]

